#Вычеслить следующие выражения при помощи питон
" 10 умножить на 50 и разделить на 5 "
print( 10 * 50 / 5) # 100
'2 плюс 2 и умножить на 2'
print( 2 + 2 * 2) # 6
"получить целое число при делении 3 на 2"
print( 3 // 2) # 1

# or print(eval(input(": ")))
" получить остаток при делении 3 на 2  "
print( 3 % 2)  # 1
" 2 в квадрате "
print( 2 ** 2) # 4

" проверить себя при решении следующих задач"
print(10 + 20 -25 >= 15) # False
print(3 ** 2 <= 10 / 3)  # False
print( 15 % 4 > 3) # False
print( 10 // 3 < 10 / 3) # True

