print("Hello Pyton")  # Hello Pyton
# математические операторы
print(1 + 2)  # 3
print(10 - 5)  # 5
print(2 * 3)  # 6
print(10 / 3)  # 3.333333333335
print(10 // 3)  # 3 с помощью двойного слешь // деление до целых чисел происходит
print(10 % 3)  # 1 % остаток от деления]
print(2 ** 3)  # 1 * 2 * 2 * 2-возведение в степень производиться ** звездочками

# сравнительные операторы
print(1 > 0)  # True(истина)
print(1 < 0)  # False(лож)
print(1 >= 0)  # True(истина)
print(0 >= 0)  # True(истина)
print(-10 >= 0)  # False(лож)
print( 1 <= 5) # True(истина)
print( 1 == 1) # True(истина)  == означает  равно 1=1
print( 1 != 0) # True(истина)    != означает не равно 1 не равно 0
#логический оператор
print(not False)  #(не лож) True
print(not True)  # (не правда) False
#оператор + позволяет прибавлять не только числа но и строки
print('hello' + "World") #helloWorld-конкатенация(соединение строк)
print('hello  ' + " World ") # пробелы  hello   World


# calculator
##print(eval ('2 + 2 * 2')) - Вывести в терминале
# print(eval(input(': ')))   вывести в строку чтобы ввести цифры в терминале

print(eval(input(': ')))

