# # password = input('enter your password: ')
# print( password)

a = 1
b = 5
print(a + b) # 6
a = 2
print(a) # 6
a = 'Hello'
print(a)
c = 0
c = 1
message = ""
message = " Hello"

# имя перемменной
# правило № 1 разрешен только 1 символ: _
_ = 123

# правило № 2
a1 =10
# 1a -error - нельзя начинать с цифры
# имя переменной должно быть смаленькой буквы X = 1 print(x) Будет ошибка, но можно и с большой

# правило 3 имя переменных принято называть только на англисском, но можно и на русском
# ы = 123
# print(ы)

WIDTH = 1500 #   переменная вверхнем регистре Когда все с большой буквы , когда она известна в самом начале программы и не будет изменяться   
# ,  переменная зарание известа и не будет изменяться

#  как правильно называть переменые
user_name = ' vasya' # snake_case змеинный метод
userAge = 15 # camelCase  Верблюжий метод
